[
    {
        "id": "0",
        "name": "moliere",
        "video": "cBkQOML-TDU",
        "description": "<p><strong><h2>Reconstitution 3D du Théâtre du Palais-Royal</h2></strong></p><br><br><p>Ce projet, réalisé sur une durée de 6 mois, consistait à créer une application immersive permettant de visiter une reconstitution en 3D du Théâtre du Palais-Royal tel qu'il était avant la mort de Molière en 1673.</p><br><br><p>Développée sous <strong>Unreal Engine 4</strong>, l'application offre une expérience interactive où j'ai été responsable de l'<strong>intégration 3D</strong>, de l'<strong>interface utilisateur</strong> (UI), ainsi que du <strong>développement</strong> des <strong>animations</strong> et des <strong>interactions</strong>. Ce projet a permis de plonger les utilisateurs dans une visite virtuelle du théâtre historique, mêlant précision historique et technologie moderne.</p><br><br><p>Pour en savoir plus sur ce projet, vous pouvez consulter l'article suivant : <br><br><a href='https://moliere.hypotheses.org/910' target='_blank'> Lire l'article</a></p>"
    },
    {
        "id": "1",
        "name": "sikaria",
        "video": "41HT3vvUQDY",
        "description": "<p><h2><strong>Sikaria : A silent hunt </h2></strong></p><br><br><p>Pour mon projet de fin d'études, j'ai eu l'opportunité de travailler sur <strong>Sikaria</strong>, un jeu développé sous<strong> Unreal Engine 4</strong> avec une équipe talentueuse composée de 2 producteurs, 4 graphistes 3D, 2 graphistes 2D, 4 programmeurs, 4 designers, ainsi que 3 game designers et programmeurs.</p><br><br><p>Mon rôle sur ce projet a été central et varié. J'ai pris en charge l'intégration de l'<strong>interface utilisateur</strong>, la <strong>correction des bugs</strong>, la programmation des <strong>réglages du jeu</strong>, ainsi que la conception du <strong>gamefeel</strong> et de la <strong>big picture</strong>. Ce projet a été un défi technique et créatif, où chaque détail comptait pour offrir une expérience de jeu optimale.</p><br><br><p>Le jeu a été récompensé par le <strong>Pégase du Meilleur Jeu Étudiant</strong>, une reconnaissance qui témoigne de la qualité et de l'engagement de toute l'équipe.</p><br><p>Vous pouvez découvrir Sikaria en suivant ce lien vers Itch.io :</p><br><br><p><a class='play-btn' href='https://isart-digital.itch.io/sikaria' target='_blank'></a></p>"
    },
    {
        "id": 2,
        "name": "fruitMerge",
        "video": "rceFqPD_pUY",
        "description": "<p><strong><h2>Fruit Merge 3D</h2></strong></p><br><br><p>Inspiré par le jeu populaire Suika Game, j'ai décidé de créer ma propre version en 3D, conçue spécifiquement pour les plateformes mobiles. Ce projet, développé sur <strong>Unity</strong>, a été une opportunité pour moi de mener un développement complet de A à Z. J'ai pris en charge toutes les étapes de la création, depuis la <strong>programmation</strong> du <strong>gameplay</strong> jusqu'à l'<strong>intégration</strong> des modèles 3D.</p><br><br><p>Certains des modèles 3D ont été conçus sur <strong>Blender</strong>, ce qui m'a permis d'assurer une cohérence visuelle et une optimisation des performances sur mobile. Le jeu propose une expérience fluide et engageante, combinant des éléments de réflexion et de fusion dans un environnement coloré et attrayant.</p><br><br><p>Une version <strong>WebGL</strong> du jeu est également disponible en ligne, permettant aux joueurs de découvrir Fruit Merge 3D directement depuis leur navigateur. Vous pouvez essayer le jeu ici :</p><br><center><p><iframe frameborder='0' src='https://itch.io/embed/2462926?border_width=0&amp;bg_color=000000&amp;fg_color=ffffff&amp;link_color=8400e3&amp;border_color=8600c2' width='600' height='120'><a href='https://ashmi.itch.io/fruit-merge-3d'>Fruit Merge 3D by AshMi</a></iframe></p></center>"
    },
    {
        "id": 3,
        "name": "valpalio",
        "video": "pppcgXd7by0",
        "description": "<p><strong><h2> Valpalio </h2></strong></p><br><br><p>Valpalio est un RPG développé dans le cadre d'un projet scolaire en collaboration avec une équipe de 9 graphistes, 4 concepteurs et programmateurs de jeux, ainsi que 5 designers. Le jeu se déroule dans la ville fictive de Valpalio, inspirée de la magnifique Valparaiso, où les joueurs incarnent un personnage parcourant la ville à bord de sa voiture.</p><br><br><p>L'aventure de Valpalio mêle exploration urbaine et combats au <strong>tour par tour</strong>, avec une grande variété de quêtes à accomplir. Le jeu a été développé sur <strong>Unity</strong>, où j'ai contribué en créant des <strong>shaders avec Shader Graph</strong>, en concevant et intégrant l'<strong>interface utilisateur</strong> (UI), ainsi qu'en développant le <strong>gameplay</strong>.</p><br><br><p>Ce projet a été l'occasion de mettre en pratique des compétences variées, de la création visuelle à la programmation, pour offrir une expérience de jeu immersive et captivante.</p>"
    },
    {
        "id": 4,
        "name": "underPressure",
        "video": "SxQsGRMa8lo",
        "description": "<p><strong><h2>Under Pressure</h2></strong></p><br><br><p>Under Pressure est un jeu de plateforme <strong>2D</strong> développé dans le cadre d'un projet scolaire avec une équipe composée de 8 graphistes, 4 concepteurs et programmateurs de jeux, ainsi que 3 musiciens. Ce projet, réalisé en 3 mois sur <strong>Unity</strong>, propose deux niveaux intenses et captivants, jouables sur les plateformes Windows, mobile, et via WebGL.</p><br><br><p>Dans ce projet, j'ai joué un rôle clé en prenant en charge le <strong>level design</strong>, le <strong>game design</strong>, ainsi que le développement du <strong>gameplay</strong>. J'ai également <strong>intégré</strong> les différents éléments du jeu et programmé la <strong>caméra</strong> en utilisant <strong>Cinemachine</strong> pour garantir une expérience de jeu fluide et immersive.</p><br><br><p>Vous pouvez découvrir Under Pressure en suivant ce lien :</p><br><br><p><a class='play-btn' href='PlayUnderPressure/index.html' target='_blank'></a></p>"
    },
    {
        "id": 5,
        "name": "rush",
        "video": "87CDLv69p48",
        "description": "<p><strong><h2>Rush</h2></strong></p><br><br><p>Rush est un projet scolaire dans lequel j'ai recréé le jeu RUSH avec un nouveau design, tout en utilisant <strong>Unity</strong> et <strong>Probuilder</strong>, un package de modélisation 3D intégré à Unity. En plus de reproduire l'expérience originale, j'ai conçu et développé deux nouveaux niveaux : <strong>Floating Islands</strong> et <strong>Paper Crane</strong>.</p><br><br><p>J'ai pris en charge l'ensemble du développement du jeu, incluant la <strong>création</strong> de tous les éléments <strong>3D</strong>, la <strong>programmation</strong>, ainsi que la conception des<strong> effets sonores</strong> (SFX). Ce projet m'a permis d'intégrer diverses compétences techniques pour offrir une expérience cohérente et innovante.</p><br><br><p>Vous pouvez découvrir Rush et ses niveaux inédits en suivant ce lien : <br><br><a class='play-btn' href='PlayRush/index.html' target='_blank'></a></p>"
    },
    {
        "id": 6,
        "name": "shmup",
        "video": "9rZrHvGZjaI",
        "description": "<p><strong><h2>Shmup</h2></strong><br><br><p>Dans le cadre d'un projet scolaire, j'ai créé un niveau complet de <strong>Shoot'em up (Shmup)</strong> en utilisant <strong>ActionScript 3 (AS3)</strong> avec <strong>Animate</strong> et <strong>FlashDevelop</strong>. Ce projet m'a permis d'explorer les différentes facettes de la conception d'un jeu de type Shmup, en prenant en charge le <strong>level design</strong>, la conception des <strong>boss</strong> et le développement complet du niveau.</p><br><br><p>J'ai travaillé sur la <strong>programmation</strong> <strong>des mécaniques de jeu</strong>, la <strong>conception des ennemis et des boss</strong>, ainsi que sur l'<strong>intégration des éléments graphiques</strong> et des animations, pour offrir une expérience de jeu dynamique et engageante.</p>"
    },
    {
        "id": 7,
        "name": "heroDash",
        "video": "WiKsGlsLfZE",
        "description": "<p><strong><h2>Hero Dash</h2></strong><br><br><p>Pour ce projet scolaire, j'ai développé un <strong>One Button Game</strong> en utilisant <strong>Haxe</strong> avec <strong>OpenFl</strong>. Le défi était de créer un gameplay innovant et captivant en se limitant à une seule interaction : un bouton.</p><br><br><p>J'ai réalisé l'intégralité du jeu, en utilisant des assets 2D gratuits pour les visuels. J'ai conçu le <strong>game design</strong>, programmé l'ensemble des <strong>mécaniques de jeu</strong>, et créé les <strong>effets visuels</strong> (FX). Ce projet m'a permis de démontrer ma capacité à transformer une contrainte simple en une expérience de jeu engageante et unique.</p>"
    },
    {
        "id": 8,
        "name": "sokoban",
        "video": "K0cAXqhaCZA",
        "description": "<p><strong><h2>Sokoban</h2></strong></p><br><br><p>Pour ce projet, nous avons travaillé en équipe de 3 pour créer un <strong>Sokoban</strong> avec une mécanique spéciale : les <strong>caisses jumelles</strong>. Développé en <strong>Haxe</strong> avec <strong>OpenFl</strong>, ce projet ajoutait une nouvelle dimension au gameplay traditionnel en liant les mouvements de deux caisses simultanément.</p><br><br><p>J'ai pris en charge l'intégration de l'<strong>interface utilisateur (UI)</strong> ainsi que la programmation des <strong>mécaniques de gameplay</strong>. Ce projet m'a permis de mettre en avant mes compétences en conception de gameplay et en développement dans un cadre collaboratif.</p>"
    },
    {
        "id": 9,
        "name": "niceCube",
        "video": "aXbGtn89mfg",
        "description": "<p><strong><h2>Nice Cube</h2></strong></p><br><br><p><strong>Nice Cube</strong> est un projet développé sous <strong>Unity 3D</strong> en 2 mois et prévu pour Android. J'ai créé une base de données pour la gestion des comptes utilisateurs, en utilisant <strong>PHP</strong> et <strong>SQL</strong>. Le jeu inclut un système de boutique permettant l'achat de diamants et la personnalisation du personnage, ainsi qu'une <strong>roue de la fortune</strong> pour des récompenses aléatoires.</p><br><br><p>J'ai également conçu l'<strong>interface utilisateur (UI)</strong> et pris en charge le <strong>gameplay</strong>, en veillant à offrir une expérience fluide et engageante pour les joueurs.</p>"
    },
    {
        "id": 10,
        "name": "tat",
        "video": "75XekJfMeiA",
        "description": "<p><strong><h2>Tiny Animal Town</h2></strong></p><br><br><p><strong>Tiny Animal Town</strong> est un projet développé sur Unity en une semaine dans le cadre de la Game Week d'Isart Digital. J'ai conçu l'idée du jeu et présenté un pitch devant tous les élèves, qui ont ensuite voté pour leurs concepts préférés, incluant le mien. À la suite de cette présentation, une équipe composée de 4 game artists, 1 musicien, 1 game developer, et moi-même, game designer et programmeur, m'a rejoint pour réaliser le projet.</p><br><br><p>Le jeu se déroule dans une ville découpée en une grille de cubes, où le but est de créer un chemin pour que le personnage retrouve sa route. Le joueur doit sélectionner un nombre limité de cubes pour tracer le chemin le plus court possible.</p><br><br><p>J'ai contribué au <strong>gameplay</strong>, au <strong>game design</strong>, ainsi qu'au <strong>level design</strong>. Ce projet a permis de collaborer sur plusieurs aspects créatifs et techniques pour offrir une expérience de réflexion et de stratégie en un temps limité.</p>"
    },
    {
        "id": 11,
        "name": "theReport",
        "video": "vBGanXJ8rR4",
        "description": "<p><strong><h2>The Report</h2></strong></p><br><br><p><strong>The Report</strong> est un projet réalisé en équipe de 5, avec pour objectif de créer une introduction de 10 minutes à un jeu narratif. Le jeu a été développé sur <strong>Unreal Engine</strong> en utilisant les <strong>Blueprints</strong>, permettant de se concentrer sur la narration et les mécaniques de jeu.</p><br><br><p>J'ai travaillé sur le <strong>scénario</strong>, le <strong>gameplay</strong>, ainsi que sur le <strong>game design</strong> et le <strong>level design</strong>, en concevant des niveaux qui renforcent l'histoire. J'ai également pris en charge l'<strong>UI design</strong> et la <strong>programmation</strong> des systèmes du jeu via Blueprint.</p>"
    },
    {
        "id": 12,
        "name": "carreJumper",
        "video": "4Vr3cbKROxc",
        "description": "<h2><strong>Carre Jumper</strong></h2><p><br /><br /></p><p><strong>Carre Jumper</strong> est un projet personnel, mon premier jeu mobile hyper casual développé sur <strong>Unity 3D</strong>. J'ai pris en charge l'ensemble du développement, incluant la <strong>programmation des mécaniques de jeu</strong>, la <strong>gestion de l'UI</strong>, et l'implémentation d'un <strong>classement des joueurs</strong> pour suivre leurs scores avec leur compte google.</p><p><br /><br /></p><p>J'ai également intégré un système de <strong>missions</strong>, la <strong>personnalisation des personnages</strong>, ainsi qu'une <strong>boutique virtuelle</strong> permettant d'acheter de nouveaux personnages avec les pièces collectées en jeu.</p>"
    },
    {
        "id": 13,
        "name": "chillySpace",
        "video": "ArPxwL1Jhbs",
        "description": "<p><h2><strong>Chilly Space</strong></h2></p><br><br><p><strong>Chilly Space</strong> est un projet personnel, un jeu mobile développé sur <strong>Unity</strong>. Il s'agit d'un <strong>one button game</strong> où le joueur contrôle un vaisseau spatial à travers un environnement infini généré de façon <strong>procédurale</strong>.</p><br><br><p>J'ai développé l'intégralité du jeu, incluant la <strong>programmation des mécaniques de jeu</strong>, un <strong>système de personnalisation du vaisseau</strong>, et un <strong>système de niveaux infinis</strong>. Le tout est conçu pour offrir une expérience fluide et dynamique avec une génération continue des obstacles.</p>"
    },
    {
        "id": 14,
        "name": "linearEscape",
        "video": "BHbv6BlrkbI",
        "description": "<p><h2><strong>Linear Escape</strong></h2></p><br><br><p><strong>Linear Escape</strong> est un prototype de jeu mobile développé sur <strong>Unity3D</strong>. Il s'agit d'un jeu de <strong>puzzle en 3D</strong> où le personnage se déplace sur une grille de cubes et doit interagir avec des plaques en déplaçant des objets pour résoudre les énigmes.</p><br><br><p>J'ai conçu l'intégralité du jeu, en prenant en charge la <strong>programmation des mécaniques de puzzle</strong>, le <strong>gameplay</strong>, ainsi que la <strong>gestion de la grille de déplacement</strong> et des interactions entre les objets et les plaques. Ce projet m'a permis d'explorer des concepts de puzzle complexes en 3D.</p>"
    },
    {
        "id": 15,
        "name": "memoryMatch",
        "video": "w5fWTvMUpAw",
        "description": "<p><h2><strong>Memory Match</strong></h2></p><br><br><p><strong>Memory Match</strong> est mon tout premier jeu mobile développé sans tutoriel, entièrement réalisé sur <strong>Android Studio</strong>. Il s'agit d'une recréation du jeu classique <strong>Memory Match</strong>, où les joueurs doivent associer des paires de cartes identiques.</p><br><br><p>J'ai développé l'intégralité du jeu, y compris la <strong>programmation des mécaniques de jeu</strong>, la gestion de l'<strong>interface utilisateur</strong>, ainsi que l'implémentation du <strong>score et des niveaux</strong>. Ce projet m'a permis de me familiariser avec Android Studio et la création de jeux video ainsi que de poser les bases de mes compétences en développement mobile.</p>"
    },
    {
        "id": 16,
        "name": "spaceWalk",
        "video": "CpHPxHHjL8I",
        "description": "<p><h2><strong>Space Walk</strong></h2></p><br><br><p><strong>Space Walk</strong> est un projet réalisé dans le cadre scolaire sur <strong>Unreal Engine 4.27</strong>, avec le thème <strong>Floor is Lava</strong>. Il s'agit de mon premier jeu développé avec UE4, visant à me familiariser avec cette technologie.</p><br><br><p>Le jeu est un <strong>first-person platformer</strong> intégrant une <strong>intelligence artificielle</strong> (IA) pour enrichir l'expérience de jeu. J'ai pris en charge la <strong>programmation des mécaniques de jeu</strong>, le <strong>design des niveaux</strong>, ainsi que l'<strong>implémentation de l'IA</strong>.</p>"
    }
]